package com.rostertwo;
//Написать программу ”Hello, World!”.
//
//В ходе выполнения программы она должна выбросить исключение и завершиться с ошибкой:
//
//Смоделировав ошибку «NullPointerException»
//Смоделировав ошибку «ArrayIndexOutOfBoundsException»
//Вызвав свой вариант ошибки через оператор throw

public class HelloWorld {
  public static void main(String[] args) {
    String[] strArr = new String[1];

//Смоделировав ошибку «NullPointerException»
//    strArr[0].toLowerCase();

//Смоделировав ошибку «ArrayIndexOutOfBoundsException»
//    System.out.println(strArr[1]);

//Вызвав свой вариант ошибки через оператор throw
//    int index = 2;
//    if (index >= strArr.length) throw new MyException("Index is out of array bounds");
  
  }
}